
do

local function abuali(msg, matches)
local reply_id = msg['id']
if is_momod(msg) and matches[1]== 'م1' then
local S = [[  
👥 أوامر الترقية في المجموعة
➖🔹➖🔹➖🔹➖🔹➖🔹
▫️ رفع المدير :: لرفع مدير
▫️ رفع ادمن :: لرفع ادمن
▫️ رفع اداري :: لرفع اداري
▫️ تنزيل ادمن :: لتنزيل ادمن
▫️ تنزيل اداري :: لتنزيل اداري
▫️ مدير المجموعه :: لعرض مدير المجموعه
▫️ المشرفين :: لعرض قائمة المشرفين
▫️ الاداريين :: لعرض الادريين
➖🔹➖🔹➖🔹➖🔹➖🔹
⛔️ أوامر الحظر في المجموعة
▫️ حظر :: لحظر المستخدم
▫️ الغاء الحظر :: لالغاء الحظر عن المستخدم
▫️ منع :: لمنع كلمة معينة
▫️ الغاء منع :: لالغاء لمنع كلمة معينة
▫️ كتم :: لكتم المستخدم
▫️ كتم :: لالغاء الكتم عن المستخدم
▫️ المكتومين :: لعرض المكتومين
➖🔹➖🔹➖🔹➖🔹➖🔹
▫️ تاك كلمه :: لعمل تاك للكل 
▫️ تصميم :: لتصميم اسم معين 
▫️ زخرفه :: لزخرفه اسم معين باللغه العربيه
▫️ write :: لزخرفه اسم معين باللغه الانكليزيه
➖🔹➖🔹➖🔹➖🔹➖🔹
💯-Đєⱴ💀: @abu0ali
💯-Đєⱴ ฿๏ͳ💀: @abu0alibot
]]
reply_msg(reply_id, S, ok_cb, false) 
end

if not is_momod(msg) then
local S = "  للـمـشـرفـيـن فـقـط 👮"
reply_msg(reply_id, S, ok_cb, false)
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م1)$",
},
run = abuali
}
end